Revit 2027 API
MultistoryStairs.Create Method
 Creates a multistory stairs from an existing component-based stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MultistoryStairs Create(
	Stairs stairs
)
Public Shared Function Create (
	stairs As Stairs
) As MultistoryStairs
public:
static MultistoryStairs^ Create(
	Stairs^ stairs
)
static member Create :
        stairs : Stairs -> MultistoryStairs
Parameters
stairs Stairs
 A component-based stairs.
Return Value
MultistoryStairs
 The newly created element. Use [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] to extend this to multiple stories and generate stairs groups for each level height.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace